In [1]:
from __future__ import print_function, division
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
unames=['user_id','gender','age','occupation','zip']

In [3]:
users=pd.read_table('movielens/users.dat',sep='::',header=None, names=unames)

<ipython-input-3-2d3d2bbfbce3>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  users=pd.read_table('movielens/users.dat',sep='::',header=None, names=unames)

In [4]:
rnames=['user_id','movie_id','rating','timestamp']
ratings=pd.read_table('movielens/ratings.dat',sep='::',header=None,names=rnames)

<ipython-input-4-56b6f7341541>:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  ratings=pd.read_table('movielens/ratings.dat',sep='::',header=None,names=rnames)

In [5]:
mnames=['movie_id','title','genres']
movies=pd.read_table('movielens/movies.dat',sep='::',header=None,names=mnames)

<ipython-input-5-e36b6c0a6948>:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies=pd.read_table('movielens/movies.dat',sep='::',header=None,names=mnames)

In [6]:
users['user_id']=users['user_id'].astype('object')

In [7]:
users.head()

  user_id gender  age  occupation    zip
0       1      F    1          10  48067
1       2      M   56          16  70072
2       3      M   25          15  55117
3       4      M   45           7  02460
4       5      M   25          20  55455

In [8]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6040 entries, 0 to 6039
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     6040 non-null   object
 1   gender      6040 non-null   object
 2   age         6040 non-null   int64
 3   occupation  6040 non-null   int64
 4   zip         6040 non-null   object
dtypes: int64(2), object(3)
memory usage: 236.1+ KB

In [9]:
data=pd.merge(users,ratings,on='user_id')

In [10]:
data.head()

Empty DataFrame
Columns: [user_id, gender, age, occupation, zip, movie_id, rating, timestamp]
Index: []

In [11]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000210 entries, 0 to 1000209
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   user_id    1000210 non-null  object
 1   movie_id   1000210 non-null  object
 2   rating     1000210 non-null  object
 3   timestamp  1000210 non-null  object
dtypes: object(4)
memory usage: 30.5+ MB

In [12]:
data

Empty DataFrame
Columns: [user_id, gender, age, occupation, zip, movie_id, rating, timestamp]
Index: []

In [13]:
ratings

        user_id movie_id  rating  timestamp
0        userId  movieId  rating  timestamp
1             1     1193       5  978300760
2             1      661       3  978302109
3             1      914       3  978301968
4             1     3408       4  978300275
...         ...      ...     ...        ...
1000205    6040     1091       1  956716541
1000206    6040     1094       5  956704887
1000207    6040      562       5  956704746
1000208    6040     1096       4  956715648
1000209    6040     1097       4  956715569

[1000210 rows x 4 columns]

In [18]:
data2=pd.merge(ratings,users,how='left',on=['user_id'])

In [19]:
data2

        user_id movie_id  rating  timestamp gender  age  occupation  zip
0        userId  movieId  rating  timestamp    NaN  NaN         NaN  NaN
1             1     1193       5  978300760    NaN  NaN         NaN  NaN
2             1      661       3  978302109    NaN  NaN         NaN  NaN
3             1      914       3  978301968    NaN  NaN         NaN  NaN
4             1     3408       4  978300275    NaN  NaN         NaN  NaN
...         ...      ...     ...        ...    ...  ...         ...  ...
1000205    6040     1091       1  956716541    NaN  NaN         NaN  NaN
1000206    6040     1094       5  956704887    NaN  NaN         NaN  NaN
1000207    6040      562       5  956704746    NaN  NaN         NaN  NaN
1000208    6040     1096       4  956715648    NaN  NaN         NaN  NaN
1000209    6040     1097       4  956715569    NaN  NaN         NaN  NaN

[1000210 rows x 8 columns]